import java.util.Random;
import java.util.Scanner;

import login.pataDTO;

public class 데빌몬테스트 extends pataDTO{

	public 데빌몬테스트(String name, int lv, int hp, String con) {
		super(name, lv, hp, con);
		// TODO Auto-generated constructor stub
	}

	public static void main(String[] args) throws InterruptedException {
	int patask1 = 9;    // 몸통박치기, (값을 어떻게설정해야하지?)
	int airshot = 1;    //공기팡은 바로바로 못씀. (공기팡의 스택)
	int damage = 1 ;
	int array[] = new int[10];
	int devilhp = 100;   //데빌몬 피 설정
	int patalevel=4;
	
	int patahp=20;
	//파닥몬의 
	int patastr =1;
	int bosspoint = 0; //보스포인트 변수로 while문과 if문 작동 조절
			
			Scanner sc = new Scanner(System.in);
			Random rd = new Random();

			
			String art2 = """

                    
	                 #(                              #%%                            
	               *%%,                              .%#%%*                         
	              #&%%                                #%#&&%%                       
	             %&%%%                                .%&%@&@&#                     
	           .%&&%&*                                 %%&%@@@@&%.                  
	           %&@%@%*                                 %%@%@@ @@@&%(                
	          #&@%&@%/                                 #%@&&@, *@@&%,               
	         %@@%%&&%/                                 #%@&%@@@   @@&/              
	        *&@,%%@%&%                                 %%@%%@@@@@@&@@@%             
	        #@( %@@%@%.                           ,    %%%%%&@//@@@@@@@&            
	       %&@ /%@@&@%.           ,*.          ./&    *#%%%%%@  .@@@@&@@%.          
	       %@@&%&@@&@@(,..    ,%%%&@@@#*/#%%%&@%*    .%%# %%%@    @@@@@@@%,         
	      %&@@@%@&&&*@&(#%%%&&%&%%&@@@@@%/          .%%%#  /%@/    @@@@@@@&,        
	     .#@@@%%@@&(.@@&     .&%@&&@@&@.           .%%#%   .%@@    @@@@@@@@%.       
	     %@@@@%@@@%% #@@#     (,,,*(@@@/          (%%%#%    #&@,   @@@@@  @@%.      
	    .%@@@&%@@@&@. /@@#     (#%(@@@@(.       *%%@%%#%    (&@    @@@@@ ,@@@%      
	    &&@@@%&@,/@@.  (@@&   ./%%&@@@@&&..,  ,%&@@@@%%%/   *&@   /@@@@% /(&@@*     
	   ,#@@@@%@@#(@@@/&@&#%&%%#%%%%%%%#%%#%&&@@@@@@@@&@##(  *&@.  @&@&@(    &@@.    
	   (%@@@&%@@@@.&&@@%%%##%%@%%%#(/%%&@&%@%&@&&@@@@@@@%%, /&@@@@&@ (&@.   ,@@/    
	   %&@* %@@@%  (@@%&&*#%@##&%%/***%@@%@@@&(@(&@@@( @@%%%%&@@@@@   @@(    @@@    
	  ,%@@  #@@@,  ,@@&@#(#(/*(((%%%#//@@@&@@&#&(&@@@% ,@@%%&@@@@@@  (@@@    (@@*   
	  %&@@  %@@@#   @@@@&#%%*/%&@&%@@#@@@@@@@@%%%@@@@@,#@@%%%@@@@@@,  @@@.    @@@   
	  %@&&#,%@@@@@, &@@&@&@&@%&@@@%&@@@@@@@&&@@@&@@@@@@@@@%%%@@@@@@/ /@@@*    &@&,  
	  %@&# (%@@@&@@@@@&%%@&&@%&@@%%@@@@@@@@%%&@%@@@@@@@&@@%%%@@@@@@&@&@&@&   .@@@%  
	 /%@/  %&@@@@@@@@@@(@@&&@%@@@%%@@#  &@@%%%@%&.@@@@@@@@%%%@@@@@@@@@@@@@@  &@@@@. 
	 %%@   %@@@, (@@*/@(&@@@(&&(@@@@@,   .  %%&&/   (@,.@%%%%@@@@@@@@@@@@@@@@@@@@@# 
	 %&@/  %@@(   %@.  %&@@#///%@@@@@,       %%&%   .@  &%%%&@@@@@@@@@@@@@@@@@@@@@& 
	 %@@@(,%@@.    @,  %&@@%##*&@&&@@@       %&@%       &#%%&@@@@@@@@@@@@. ,@@@@@@@ 
	,%@@@@@%@%     ,  #&@@&@%&&(@@@&@@#     (#@@%      .%%%%@@@@@@@@@@@@&    @@&@@@.
	,%&@@@@&&@        %&&%%%%%#%%#&@@@#    .%%@@&*     ,%#&&@@@@@@@@@@@@&    /@@@@@.
	 %@&@@@/&@,       #%@%%%%#%%%&@@@@#    ,#&@%@&     .%%%@@&@@&  *@@@@@     @&@@@*
	.#@@@@# %@@@      %%&%#%%@&&%#&@@@%     #%@%@&     %%%%@@@@#/   %@@@@.   /@@@@@/
	,%&@@@  %@@@(     /%&&%%&#@@@@@@%@&%     %&@@%    *%,(&@@.      /@@@*   *@@@@@@%
	,%&@@%  %&@.      ,&%&%%%&@@@@@@&@&%     /%@@*    %/ &@@@       @@@(     (@@@@@@
	,%&@@*  *%@       .%%&%%%#@@&&@@%@&(     .&@@*   /# ,&@@@/     #@@,       @@@@@@
	,#@@@@%  ##       .&&&%%/%@%%%@@@@&      .&@@#   .  (@@@@*                &@@@@@
	.%@@@&@. (&       .&&&,%%&%@%%@@@@%       &@@#     .&@@@%                  ,@@@@
	 #&@@@@   %       .%&@ #%%&@%&@@@@/       (&@%.    /@@@*                    %@@@
	 %&@@(    (       .%&% /(%#&%&@@@@,       #@&(%.   @@(                       @@@
	 %&@@             /%&/ */%/@%&@@@@%       /@&##   /%                         &@@
	 %&@&             (&&*   (((%%%@@@*       *@&@@.                             @&@
	 /&@/             (&&,   /(*%#%%&@@       ,@&&%*                            &@@@
	 .#&,             %&&,    */&%%%&&&*      .@&%.                             &@@@
	  %@,             &&&*    ,%&%&&&@@       *@&%(                             &&@#
	  %@@            #&@@       #%&@@@@,      /&&%%                             &@@/
	  *%@         ,/#(%%@.      *&%&%&@/      %@&&%#                            &@@*
	   %@       (&%#&&%&#        %%&&@&      (&&&&&%&#                          &@@.
	   /%     #%&&&&&&@,        .%%&@@@,     /&%&&&&%%#%%#.                     &@@ 
	    %/    &%&%&&&&   (/     ,%#@@@@#      @&../&@&&&&&&&&#%%/               &@# 
	    *&   ,@&%#(&@%%%%       /%%&@@@@      (@(    .%@& *@@@&/#%              &@* 
	     (    *@/%%,.#%%#       (##%&@@@,      *@#      %&,  &@&.               &@. 
	            #  (%.           (&@@@@@(       .&       /@.  @*#               @#  
	                            #%%#%&&@*                 &/   ,                @,  
	                           **%%@@@@@#                  .                   /@   
	                      **,,&@&%&@@@@@@                                      &.   
	                *#%,.##%%(#&&%%%%&@@@                                           
	              %%%&@@((&@@&&%%*%#%%%#.                                           
	              /###((#/,.    #*/***#%                                            
	                           .//#&/(@&(                                           
	                           /%(%##*#@%*                                          
	                           *%#%%##%&&%                                          
	                            #%%%%#&@@#                                          
	                             .%%%%&%%.                                          

						
						""";
			for (int i = 0; i < art2.length(); i++) {
				System.out.print(art2.charAt(i));
			//	Thread.sleep(2);
			}
				System.out.println(" [경고!!!!!] 데빌몬과 전투합니다. 전투에서 패배하면 게임이 끝납니다. 계속하시겠습니까?");
				System.out.println("          <     파닥몬의 레벨이 5 이상일때 도전가능    >");
				System.out.println();
				System.out.println("계속하시려면 [1]번 아니면 [2]번 누르세요.");
				int boss = sc.nextInt();
				if(boss==1) {
					while(patalevel>=5 == true) {
						
				     		System.out.println("                데빌몬이 등장했다!!");
							System.out.println();
							System.out.println("===============================================");
							System.out.println();

								System.out.println("             데빌몬과 전투 시작!!!!");
								System.out.println();
								System.out.println("============== 사용할 기술을 선택하세요 ==============");

								while (true) {
									
									System.out.println(" [1]몸통박치기 [2]공기팡 [3]웅크리기");
									int sel3 = sc.nextInt();

									if (sel3 == 1) {
										// 몸통박치기
										System.out.println("============== 사용할 기술을 선택하세요 ==============");
										System.out.println();
										System.out.println("              몸통박치기!!       ");
										System.out.println();

										airshot += 1; // 공기팡 가능
										damage = patask1 + patastr;

										//데빌몬 hp따로 설정.
										devilhp -= damage;
										System.out.println("-     데빌몬 에게 " + damage + " 의 피해를 입혔다." + "(데빌몬의 남은HP :" + devilhp + ")");

										int devildam = rd.nextInt(10) + 1;
										System.out.println("-     데빌몬 의 공격!! " + devildam + " 의 피해를 받았다ㅠㅠ"+ "(파닥몬의 남은HP :" + patahp + ")");
										patahp -= devildam;
										System.out.println("===============================================");
			//데빌몬에게 패배한 코드	
										if (patahp<=0) {
											System.out.println();
											System.out.println("            데빌몬 에게 패배했습니다.......");
											System.out.println();
											System.out.println("         디지몬월드는 데빌몬이 점령했습니다ㅠㅠㅠㅠㅠ ");
											bosspoint--;
											break;
										}
										if (devilhp <= 0) {
											System.out.println("    와~~~~     데빌몬에게 이겼다!!!ㅎㅎㅎ ");
											System.out.println();
											System.out.println("           - 디지몬 월드의 평화를 되찾았다 -");
											System.out.println();
											bosspoint--;
							//게임 엔딩 	파트			
											break;
											
										}
										System.out.println("                   ㅣ");
										System.out.println("                   ㅣ");
										System.out.println("                   ㅣ");
										
										// hp -= dam;

										System.out.println("============== 사용할 기술을 선택하세요 ==============");

									} else if (sel3 == 2) {

										if (airshot <= 0) {
											System.out.println("-- 공기가 부족해서 공기팡은 연속으로 사용할수 없습니다. --");
											System.out.println("-- 공기를 모으는 동안 다른기술을 사용해주세요. --");
											System.out.println();
										} else {
											//*****mp3 파일 자리 공기팡
											String art3 = """
													#%####(###(                                     (%##########,
													       .#%####(#(##(                                  (##########
													         #%%######((#%/                                (#(####(%@
													         ##########((/%#(                              (%#(##((#.
													            ((#(###(#####(                          /#%##((#(/#(
													               *%####(#%%(                       /%##(#((((####
													                #%%#####%%(                      (%%###((#(##(
													               *%########%#(                     /#%#####(
													                ,//(#%%#(####/                   (%###(
													                        ((%##((                ####(
													                    *(#/   .((##(########((/(/(##(
													                 //((###(/#################((###(
													              ((######(#(#####(*###(*(/########(##(
													           ,(########################(/((####(#/(#//
													          /((######%#########(#####((##%#####%%%%&%#/
													    (/   /################(#%%&%%%%##(///////////(#%%&#
													    *,&@%@%#(####(####%@@@@@&%%##(//////////////////#%%#
													     (&&(@@&#####(#&@@@@@@&%%%#(/////////////////(((((%%*
													     /%%/@@@@&##&@@@@@@@@&%%%/////////////////((//////#%#
													      #&%&@@@@@@@@@@@@@@&%%#//////((((((((//******,,,,/(/
													       #&&@@@@@@@@@@@@@@&%%(((((((####((/*,,..........*/.
													        #&&@@@@@@@@@@@@@&&%#%%%%%%###((/*,.     ......**
													         #%&&@@@@@@@@@@@@&&%&&&&&&&%#(/*,,.          ,*.
													          /%&&@@@@@@@&&@@@@&&&&&&&%##/*,,,,.        ,,*
													            #&&&@&&&@@@@@@@@&&&&&&%##(/***,,.......,,
													              %&%&&@@@@@@@@@@&&&&&%%##((////*,,,,*/.
													               /%#%&&&@@@@@@@@@&&%%%###((((///(#(
													                *%&&#%&&&&&@@@@@@@@&%##((#%####
													                 ,&@@@&#&((%&&&&&&&&%%####
													                   %@@@&&(%&#*
													                     (/..*(&
													                      (/
													           .,,,,,,,    .,,,,,,,.  #@@:                 .,,,,,,,.  *@@*        @@@,
													          -@@@@@@@@#  -#@@@@@@@=. @@@:                .@@@@@@@@@. *@@=        @@@,
													          -@@@@@@@@#  :@@@@@@@@$. @@@:                .@@@@@@@@@, *@@=        @@@,
													          .;;;;;*@@#  ,;;;;;$@@$. @@@:                 *@@@*@@@;. *@@=        @@@,
													                ~@@#        *@@$. @@@:                 -#@@~@@@   *@@=        @@@,
													                ~@@#        *@@$. @@@:                 -#@@~@@@   *@@@##;     @@@,
													                ~@@#        *@@$. @@@:                 -#@@~@@@   *@@@@@@     @@@,
													                ~@@#        *@@$. @@@:                 -#@@~@@@   *@@@@@$     @@@,
													                ~@@#        *@@$. @@@:                 *@@@=@@@!  *@@$::,     @@@,
													                :@@#        *@@$. @@@:                .@@@@@@@@@, *@@=        @@@,
													             ;@@@@@#        *@@$. @@@:                .@@@@@@@@@, *@@=        @@@,
													             ;@@@*$~        .=$!  @@@:                 ;$$$$$$$!  *@@=        @@@,
													             ;@@#                 @@@:                            *@@=        #@@,
													          ;!!$@@@!!!.             @@@:                            *@@=        -:~
													          #@@@@@@@@@=             @@@:                            *@@=
													          #@@@@@@@@@$             @@@:                            *@@=        @@@-
													          ,::::::::~              @@@:                            *@@=        @@@-
													             ,::~.                @@@:                            *@@=        *$=,
													            *$@@@=~               *@@:                          ,*#@@#*,      .,.
													           $@@@@@@@-               ..                           #@@@@@@#.
													          ~@@@##@@@#                                           =@@@##@@@*
													          #@@!  ,#@@:                                         .@@@~  ~@@@.
													         .#@@~   ;@@$                                         ;@@=.  ,$@@~
													         .#@@:   ;@@$                                         ~@@=.  ,#@@~
													          #@@=. ,#@@-                                          @@@;  ;@@@
													          -@@@#$@@@$                                           *@@@$$@@@;
													           ;#@@@@@$,                                            *@@@@@@*.
													            ~!#@=;,                                             .;*@@*:.
													              ,,.                                                 .,,.

																""";
											for (int i = 0; i < art3.length(); i++) {
												System.out.print(art3.charAt(i));
												Thread.sleep(1);
											}
											damage = patastr + 2;
//											damage = str + 2;
											System.out.println("          공기~~~~~~~~팡!!!!!!!");
											System.out.println();
											System.out.println();
											airshot -= 1;

											devilhp -= damage;
											System.out.println("-     데빌몬 에게 " + damage + " 의 피해를 입혔다." + "(데빌몬의 남은HP :" + devilhp + ")");

											int devildam = rd.nextInt(10) + 1;
											System.out.println("-     데빌몬 의 공격!! " + devildam + " 의 피해를 받았다ㅠㅠ"+ "(파닥몬의 남은HP :" + patahp + ")");
											patahp -= devildam;
											System.out.println("===============================================");
							//데빌몬에게 패배한 코드	
											if (patahp<=0) {
												System.out.println();
												System.out.println("            적에게 패배했습니다.......");
												System.out.println();
												System.out.println("        포만감이 10 줄어들고 피로도가 10 증가합니다. ");
												
												break;
											}
											if (devilhp <= 0) {
												System.out.println("    와~~~~     데빌몬에게 이겼다!!!ㅎㅎㅎ ");
												System.out.println();
												System.out.println("           - 디지몬 월드의 평화를 되찾았다 - ");
												System.out.println();
												bosspoint--;
												break;
								// 게임엔딩			
												
											}
											System.out.println("                   ㅣ");
											System.out.println("                   ㅣ");
											System.out.println("                   ㅣ");
											// hp -= dam;
											System.out.println("============== 사용할 기술을 선택하세요 ==============");
										}

									} else {
										System.out.println();
										System.out.println("     파닥몬이 몸을 웅크려서 체력을 회복했다.");
										// 웅크리기
										patahp=+3;
										airshot += 1;
										System.out.println("     파닥몬의 체력 3 회복!!! "+"(파닥몬의 HP :"+patahp+")");
										System.out.println();
										int devildam = rd.nextInt(10) + 1;
										System.out.println("-     데빌몬 의 공격!! " + devildam + " 의 피해를 받았다ㅠㅠ"+ "(파닥몬의 남은HP :" + patahp + ")");
										patahp -= devildam;
										System.out.println("===============================================");
					//데빌몬에게 패배한 코드	
										if (patahp<=0) {
											System.out.println();
											System.out.println("            적에게 패배했습니다.......");
											System.out.println();
											System.out.println("        포만감이 10 줄어들고 피로도가 10 증가합니다. ");

											break;
										}
									}
									
									
								}break;
								//위의 break; 는 데빌몬과 전투 이겼을때 전투 메뉴 while문 빠져나오기
							
					}
						if(patalevel<5) {System.out.println();
						System.out.println("======== 파닥몬의 레벨이 낮아서 도전할수 없습니다 ========");
						System.out.println();
						}
				}
				bosspoint++;
				if(bosspoint>0) {System.out.println("            메인으로 돌아갑니다.");
						System.out.println();
						System.out.println();
						System.out.println("===============================================");
						System.out.println("           이젠 뭘할까...?");
						System.out.println();
						bosspoint =0;
				}else if(bosspoint<0){
					System.out.println("THE END");
					
					//이부분에 게임오버 엔딩을 넣어야함. 보스포인트 변수를 줌.
				}
		System.out.println("마지막메소드");
				//여기가 평화를 되찾았다 도 나오고 메인돌아가기 다음도 나옴.	
	}
}
